Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase
Represents a (potentially) draggable handle

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.WrappedHandle
Contains the underlying DM handle

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.ITranslationHandle)
Constructs an instance of the Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase class.
wrappedHandle: The handle to be wrapped.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.IsDragOngoing
Gets a value indicating whether the handle is being dragged.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.IsHighlighted
Gets a value indicating whether the handle is highlighted.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.IsSelected
Gets a value indicating whether the handle is selected.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.IsInvalid
Gets or sets a value indicating whether the handle is invalid (which may change its appearance).

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.IsVisible
Gets a value indicating whether the handle is visible.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.Tag
Gets or sets a value that contains additional info for the handle. As a user, this may be set to transport
information related to the context of the handle.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.DragStarted
Occurs when dragging starts.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.DragOngoing
Occurs while dragging continues at periodic intervals.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.DragEnded
Occurs when dragging ends.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.SelectedChanged
Occurs when the value of the Tekla.BIM.DirectManipulation.Services.Interaction.IHandle.Selected property has changed.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.ContextualToolsRequested
Occurs when the contextual toolbar should be drawn.
Remarks:
The signature of this event handler is very non-standard, and it should never
be exposed publically.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.Dispose
Disposes the handle. This can be used to remove a handle from the screen.
Remarks:
The object becomes unusable after calling dispose, and it is unsafe to use the properties of the handle.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.SetFreeTolerationBehavior
Sets the toleration behavior to be free toleration.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.SetLineTolerationBehavior(Tekla.Structures.Geometry3d.Line)
Sets the toleration behavior to be restricted to the tolerationLine.
tolerationLine: The line to define the toleration line.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.SetPlaneTolerationBehavior(Tekla.Structures.Geometry3d.GeometricPlane)
Sets the toleration behavior to be restricted to the plane defined by the tolerationPlane.
tolerationPlane: The plane to define the toleration plane.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.Dispose(System.Boolean)
Disposes all resources from the handle.
disposing: The disposing.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.ToDragEventArgs(Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEventArgs)
Converts a native DM handle event args to DM API drag event args.
nativeArgs: Native DM arguments.
Returns: DM API event args.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.ToSelectionEventArgs(Tekla.BIM.DirectManipulation.Services.Interaction.HandleSelectionEventArgs)
Converts a native DM handle event args to DM API selection event args.
nativeArgs: Native DM arguments.
Returns: DM API event args.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.OnDragStarted(Tekla.BIM.DirectManipulation.Services.Interaction.ITranslationHandle,Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEventArgs)
Event handler for the drag started event.
sender: The sender.
eventArgs: The event arguments of type Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEventArgs.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.OnDragOngoing(Tekla.BIM.DirectManipulation.Services.Interaction.ITranslationHandle,Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEventArgs)
Event handler for the drag ongoing event.
sender: The sender.
eventArgs: The event arguments of type Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEventArgs.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.OnDragEnded(Tekla.BIM.DirectManipulation.Services.Interaction.ITranslationHandle,Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEndedEventArgs)
Event handler for the drag ended event.
sender: The sender.
eventArgs: The event arguments of type Tekla.BIM.DirectManipulation.Services.Interaction.HandleDragEndedEventArgs.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.OnSelectedChanged(Tekla.BIM.DirectManipulation.Services.Interaction.IHandle,Tekla.BIM.DirectManipulation.Services.Interaction.HandleSelectionEventArgs)
Event handler for the selected changed event.
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.OnContextualToolsRequested(Tekla.BIM.DirectManipulation.Services.Interaction.IHandle,Tekla.BIM.DirectManipulation.Services.Interaction.HandleEventArgs)
Event handler for the contextual tools requested event.
sender: The sender.
eventArgs: The event arguments of type Tekla.BIM.DirectManipulation.Services.Interaction.HandleEventArgs.
Returns: An instance of type Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.